# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
cask 'adoptopenjdk'

brew 'gradle'
brew 'sbt'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'gpg-suite'
cask 'intellij-idea'
cask 'insomnia'
cask 'inkscape'
cask 'postman'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'

# Mac App Store
# mas 'Byword', id: 420212497
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
# mas 'Tweetbot', id: 1384080005
